---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarSystemDirectionNotSpecified
source: html/4d8d021e-8a8e-3099-a332-f15509672201.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarSystemDirectionNotSpecified Property

Major direction not specified.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarSystemDirectionNotSpecified { get; }
```